# taps
tap "pulumi/tap"

# core utils
brew "git"
brew "make"
brew "cmake"
brew "jq"
brew "tree"
brew "wget"
brew "curl"
brew "telnet"
brew "ffmpeg"

# faster utils
brew "fd"
brew "fzf"
brew "ripgrep"

# my utils 
brew "neovim"
brew "neofetch"
brew "atuin"
brew "btop"
brew "hyperfine"
brew "mise"
brew "git-delta"

# dbs
brew "duckdb"
brew "libpq"
brew "mysql-client"
brew "redis"

# third party clis
brew "ykman"
brew "gh"
brew "awscli"
brew "aws-vault"
brew "pulumi/tap/esc"
brew "pulumi/tap/pulumi"
brew "wireshark"

# other?
brew "openssl@3"
brew "abseil"
brew "xz"
brew "zlib"
brew "libxml2"
brew "libxmlsec1"
brew "lapack"
brew "openblas"
brew "pkgconf"
brew "gnupg"
brew "mas"
brew "flock"

# casks
cask "git-credential-manager"
cask "font-jetbrains-mono-nerd-font"
cask "alt-tab"
cask "rectangle"
cask "google-chrome"
cask "ghostty"
cask "visual-studio-code"
cask "datagrip"
cask "orbstack"
cask "bitwarden"
cask "wireshark-app"
cask "ngrok"
cask "yaak"
cask "linear-linear"
cask "notion"
cask "reader"
cask "anki"
cask "readdle-spark"
cask "quarto"
cask "utm"
cask "obs"
cask "zoom"
cask "slack"
cask "discord"
cask "spotify"
cask "betterdisplay"
cask "logi-options+"
cask "logitune"
cask "gcloud-cli"


# vscode

## Themes
vscode "pkief.material-icon-theme"
vscode "zhuangtongfa.material-theme"
## intellisense and ai
vscode "github.copilot"
vscode "github.copilot-chat"
## other
vscode "vscodevim.vim"
vscode "eamodio.gitlens"
vscode "streetsidesoftware.code-spell-checker"
vscode "quarto.quarto"
vscode "hverlin.mise-vscode"
vscode "mikestead.dotenv"
vscode "tamasfe.even-better-toml"
vscode "bierner.markdown-mermaid"
vscode "github.vscode-github-actions"
## containers
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
## dbt
vscode "altimateai.vscode-altimate-mcp-server"
vscode "innoverio.vscode-dbt-power-user"
## python
vscode "astral-sh.ty"
vscode "charliermarsh.ruff"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
## c/c++ extension pack 
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.cpptools"
# rust
vscode "rust-lang.rust-analyzer"
## remote extension pack
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vsliveshare.vsliveshare"
## web (js/ts/css/html/web)
vscode "biomejs.biome"
vscode "esbenp.prettier-vscode"
vscode "dbaeumer.vscode-eslint"
vscode "yoavbls.pretty-ts-errors"
vscode "samuelcolvin.jinjahtml"
vscode "denoland.vscode-deno"
vscode "ritwickdey.liveserver"
vscode "bradlc.vscode-tailwindcss"

# mas
mas "iMovie", id: 408981434
mas "Kindle", id: 302584613
mas "Tailscale", id: 1475387142
mas "Microsoft Excel", id: 462058435
mas "Microsoft OneNote", id: 784801555
mas "Microsoft PowerPoint", id: 462062816
mas "ScreenBrush", id: 1233965871
