# taps
tap 'pulumi/tap'
tap 'supabase/tap'

# core utils
brew 'git'
brew 'gcc'
brew 'make'
brew 'cmake'
brew 'jq'
brew 'tree'
brew 'wget'
brew 'curl'
brew 'telnet'
brew 'ffmpeg'

# faster utils
brew 'fd'
brew 'fzf'
brew 'ripgrep'

# my utils 
brew 'neovim'
brew 'neofetch'
brew 'atuin'
brew 'btop'
brew 'hyperfine'
brew 'mise'

# dbs
brew 'sqlite3'
brew 'duckdb'
brew 'libpq'
brew 'mysql-client'
brew 'redis'

# third party clis
brew 'ykman'
brew 'gh'
brew 'awscli'
brew 'supabase/tap/supabase'
brew 'pulumi/tap/esc'
brew 'pulumi/tap/pulumi'

# other?
brew 'openssl'
brew 'abseil'
brew 'xz'
brew 'zlib'
brew 'libxml2'
brew 'libxmlsec1'
brew 'lapack'
brew 'openblas'
brew 'pkgconf' # needed for python
brew 'gnupg'

# casks
cask 'git-credential-manager'
cask 'font-jetbrains-mono-nerd-font'
cask 'alt-tab'
cask 'rectangle'
cask 'google-chrome'
cask 'ghostty'
cask 'visual-studio-code'
cask 'dbeaver-community'
cask 'orbstack'
cask 'aws-vault'
cask 'bitwarden'
cask 'insomnia'
cask 'notion'
cask 'reader'
cask 'anki'
cask 'readdle-spark'
cask 'quarto'
cask 'utm'
cask 'obs'
cask 'zoom'
cask 'slack'
cask 'discord'
cask 'spotify'
cask 'betterdisplay'
cask 'logi-options+'
cask 'logitune'
cask 'google-cloud-sdk'


# vscode

## Themes
vscode 'pkief.material-icon-theme'
vscode 'zhuangtongfa.material-theme'
## intellisense and ai
vscode 'visualstudioexptteam.intellicode-api-usage-examples'
vscode 'visualstudioexptteam.vscodeintellicode'
vscode 'github.copilot'
vscode 'github.copilot-chat'
## other
vscode 'vscodevim.vim'
vscode 'eamodio.gitlens'
vscode 'gruntfuggly.todo-tree'
vscode 'streetsidesoftware.code-spell-checker'
vscode 'quarto.quarto'
## containers
vscode 'docker.docker'
vscode 'ms-azuretools.vscode-containers'
vscode 'ms-azuretools.vscode-docker'
## dbt
vscode 'altimateai.vscode-altimate-mcp-server'
vscode 'innoverio.vscode-dbt-power-user'
## python
vscode 'charliermarsh.ruff'
vscode 'ms-python.debugpy'
vscode 'ms-python.python'
vscode 'ms-python.vscode-pylance'
vscode 'ms-toolsai.jupyter'
vscode 'ms-toolsai.jupyter-keymap'
vscode 'ms-toolsai.jupyter-renderers'
vscode 'ms-toolsai.vscode-jupyter-cell-tags'
vscode 'ms-toolsai.vscode-jupyter-slideshow'
## remote extension pack
vscode 'ms-vscode-remote.remote-containers'
vscode 'ms-vscode-remote.remote-ssh'
vscode 'ms-vscode-remote.remote-ssh-edit'
vscode 'ms-vscode-remote.remote-wsl'
vscode 'ms-vscode-remote.vscode-remote-extensionpack'
vscode 'ms-vscode.remote-explorer'
vscode 'ms-vscode.remote-server'
vscode 'ms-vsliveshare.vsliveshare'
## web (js/ts/css/html)
vscode 'esbenp.prettier-vscode'
vscode 'yoavbls.pretty-ts-errors'
vscode 'samuelcolvin.jinjahtml'
vscode 'rangav.vscode-thunder-client'

# mas
mas 'Kindle', id: 405399194
mas 'Tailscale', id: 1475387142
mas 'Microsoft Excel', id: 462058435