altimateai.vscode-altimate-mcp-server
astral-sh.ty
charliermarsh.ruff
denoland.vscode-deno
eamodio.gitlens
esbenp.prettier-vscode
innoverio.vscode-dbt-power-user
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode.cpp-devtools
ms-vscode.powershell
ms-vscode.remote-explorer
ms-vscode.remote-server
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode-remote.remote-wsl
ms-vscode-remote.vscode-remote-extensionpack
ms-vsliveshare.vsliveshare
pkief.material-icon-theme
quarto.quarto
samuelcolvin.jinjahtml
streetsidesoftware.code-spell-checker
vscodevim.vim
xaver.clang-format
yoavbls.pretty-ts-errors
zhuangtongfa.material-theme
